## Merging the csv files in two different folders into one file:

Here we have two different folders.

- domestic_visitors
- foreign_visitors

In each folder there are various csv files contain data from years 2016 to 2019. So, we have to merge all these into one file.

In [1]:
# import the required libraries..

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# loading the datasets...

df1  = pd.read_csv("E:\challenge_5\C5 Input for participants\domestic_visitors\domestic_visitors_2016.csv")
df2  = pd.read_csv("E:\challenge_5\C5 Input for participants\domestic_visitors\domestic_visitors_2017.csv")
df3  = pd.read_csv("E:\challenge_5\C5 Input for participants\domestic_visitors\domestic_visitors_2018.csv")
df4  = pd.read_csv("E:\challenge_5\C5 Input for participants\domestic_visitors\domestic_visitors_2019.csv")

In [17]:
# print first 5 rows of all datasets...

print(" First 5 rows of all datasets","\n")
print("------------------ df1 - 2016  ---------------------- ")
print("\n",df1.head(), "\n")
print("------------------ df2 - 2017 ---------------------- ")
print("\n", df2.head(), "\n")
print("------------------ df3 - 2018 ---------------------- ")
print("\n",df3.head(),"\n")
print("------------------ df4 - 2019 ---------------------- ")
print("\n",df4.head(),"\n")

 First 5 rows of all datasets

------------------ df1 - 2016  ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887

------------------ df2 - 2017 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2017   January  2017   318799
1  Adilabad  01-02-2017  February  2017    83316
2  Adilabad  01-03-2017     March  2017    27508
3  Adilabad  01-04-2017     April  2017    13946
4  Adilabad  01-05-2017       May  2017    11752

------------------ df3 - 2018 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2018   January  2018   320356
1  Adilabad  01-02-2018  February  2018    36550
2  Adilabad  01-03-2018     March  2018    23011
3  Adilabad  01-04-2018     April  2018    14183
4  Adilabad  01-05-2018       May  2018     8197

------------------ df4 - 2019 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2019   January  2019    25071
1  Adilabad  01-02-2019  February  2019   406177
2  Adilabad  01-03-2019     March  2019    14347
3  Adilabad  01-04-2019     April  2019     9972
4  Adilabad  01-05-2019       May  2019     6997

In [20]:
# Printing Total Rows and Columns of All Dataset

print("2016 \n")
print("Total Number of Rows    : ", df1.shape[0])
print("Total Number of Columns : ", df1.shape[1])
print("\n")

print("2017 \n")
print("Total Number of Rows    : ", df2.shape[0])
print("Total Number of Columns : ", df2.shape[1])
print("\n")

print("2018 \n")
print("Total Number of Rows    : ", df3.shape[0])
print("Total Number of Columns : ", df3.shape[1])
print("\n")

print("2019 \n")
print("Total Number of Rows    : ", df4.shape[0])
print("Total Number of Columns : ", df4.shape[1])

2016

Total Number of Rows    :  372
Total Number of Columns :  5


2017

Total Number of Rows    :  372
Total Number of Columns :  5


2018

Total Number of Rows    :  372
Total Number of Columns :  5


2019

Total Number of Rows    :  396
Total Number of Columns :  5

In [22]:
# Printing the Null Values of All Dataset

print("2016 \n", df1.isnull().sum() , "\n")

print("2017 \n", df2.isnull().sum() , "\n")

print("2018 \n", df3.isnull().sum() , "\n")

print("2019 \n", df4.isnull().sum())

2016
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

2017
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

2018
 district     0
date         0
month        0
year         0
visitors    12
dtype: int64

2019
 district     0
date         0
month        0
year         0
visitors    18
dtype: int64

In [24]:
df3.visitors = df3.visitors.fillna(0)
df4.visitors = df4.visitors.fillna(0)

In [29]:
print("null values in df3 : \n", "\n", df3.isnull().sum(), "\n")
print("null values in df4 : \n", "\n", df3.isnull().sum())

null values in df3 :

 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

null values in df4 :

 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [32]:
# Printing the Duplicates Values

print("2016 \n", df1.duplicated().sum())
print("2017 \n", df2.duplicated().sum())
print("2018 \n", df3.duplicated().sum())
print("2019 \n", df4.duplicated().sum())

2016
 0
2017
 0
2018
 0
2019
 0

In [33]:
# Removing the White Space

df1.visitors = df1.visitors.str.replace(' ','')
df2.visitors = df2.visitors.str.replace(' ','')
df3.visitors = df3.visitors.str.replace(' ','')
df4.visitors = df4.visitors.str.replace(' ','')

In [34]:
# Converting the dtypes of columns

df1['date'] = pd.to_datetime(df1['date'])
df2['date'] = pd.to_datetime(df2['date'])
df3['date'] = pd.to_datetime(df3['date'])
df4['date'] = pd.to_datetime(df4['date'])


df1['year'] = df1['year'].astype('int32')
df2['year'] = df2['year'].astype('int32')
df3['year'] = df3['year'].astype('int32')
df4['year'] = df4['year'].astype('int32')

df1['visitors'] = pd.to_numeric(df1['visitors'], errors='coerce')
df2['visitors'] = pd.to_numeric(df2['visitors'], errors='coerce')
df3['visitors'] = pd.to_numeric(df3['visitors'], errors='coerce')
df4['visitors'] = pd.to_numeric(df4['visitors'], errors='coerce')

In [35]:
# replace NaN and inf values with zero

df1['visitors'] = df1['visitors'].replace([np.nan, np.inf], 0)
df2['visitors'] = df2['visitors'].replace([np.nan, np.inf], 0)
df3['visitors'] = df3['visitors'].replace([np.nan, np.inf], 0)
df4['visitors'] = df4['visitors'].replace([np.nan, np.inf], 0)

In [36]:
# cast the column to int32

df1['visitors'] = df1['visitors'].astype('int32')
df2['visitors'] = df2['visitors'].astype('int32')
df3['visitors'] = df3['visitors'].astype('int32')
df4['visitors'] = df4['visitors'].astype('int32')

In [37]:
# merging all the datasets...

domestic_visitors = pd.concat([df1, df2, df3, df4], axis=0)

domestic_visitors.head()

   district       date     month  year  visitors
0  Adilabad 2016-01-01   January  2016    792136
1  Adilabad 2016-01-02  February  2016    937820
2  Adilabad 2016-01-03     March  2016    582946
3  Adilabad 2016-01-04     April  2016    341948
4  Adilabad 2016-01-05       May  2016    252887

In [38]:
domestic_visitors.tail()

            district       date      month  year  visitors
391  Yadadri Bhongir 2019-01-08     August  2019    389010
392  Yadadri Bhongir 2019-01-09  September  2019    366862
393  Yadadri Bhongir 2019-01-10    October  2019    381860
394  Yadadri Bhongir 2019-01-11   November  2019    365990
395  Yadadri Bhongir 2019-01-12   December  2019    477635

In [39]:
# Printing Total Numbers of Rows and Columns


print("Total Number of Rows    : " , domestic_visitors.shape[0])
print("Total Number of Columns : " , domestic_visitors.shape[1])

Total Number of Rows    :  1512
Total Number of Columns :  5

In [40]:
domestic_visitors.isnull().sum().sum()

0

In [41]:
domestic_visitors.duplicated().sum().sum()

0

In [42]:
# Saving the Domestic_Visitors.csv file

domestic_visitors.to_csv("domestic_visitors.csv",index=False)

## Foreign visitors :

In [44]:
# loading all datasets..

fv1 = pd.read_csv("E:/challenge_5/C5 Input for participants/foreign_visitors/foreign_visitors_2016.csv")
fv2 = pd.read_csv("E:/challenge_5/C5 Input for participants/foreign_visitors/foreign_visitors_2017.csv")
fv3 = pd.read_csv("E:/challenge_5/C5 Input for participants/foreign_visitors/foreign_visitors_2018.csv")
fv4 = pd.read_csv("E:/challenge_5/C5 Input for participants/foreign_visitors/foreign_visitors_2019.csv")

In [45]:
# print first 5 rows of all datasets...

print(" First 5 rows of all datasets","\n")
print("------------------  2016  ---------------------- ")
print("\n",fv1.head(), "\n")
print("------------------  2017 ---------------------- ")
print("\n", fv2.head(), "\n")
print("------------------  2018 ---------------------- ")
print("\n",fv3.head(),"\n")
print("------------------  2019 ---------------------- ")
print("\n",fv4.head(),"\n")

 First 5 rows of all datasets

------------------  2016  ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0
2  Adilabad  01-03-2016     March  2016        2
3  Adilabad  01-04-2016     April  2016        0
4  Adilabad  01-05-2016       May  2016        0

------------------  2017 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2017   January  2017        5
1  Adilabad  01-02-2017  February  2017        0
2  Adilabad  01-03-2017     March  2017        0
3  Adilabad  01-04-2017     April  2017        0
4  Adilabad  01-05-2017       May  2017        0

------------------  2018 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2018   January  2018        0
1  Adilabad  01-02-2018  February  2018        0
2  Adilabad  01-03-2018     March  2018        0
3  Adilabad  01-04-2018     April  2018        0
4  Adilabad  01-05-2018       May  2018        0

------------------  2019 ----------------------

    district        date     month  year visitors
0  Adilabad  01-01-2019   January  2019        0
1  Adilabad  01-02-2019  February  2019        2
2  Adilabad  01-03-2019     March  2019        0
3  Adilabad  01-04-2019     April  2019        0
4  Adilabad  01-05-2019       May  2019        0

In [46]:
# Printing Total Rows and Columns of All Dataset

print("2016 \n")
print("Total Number of Rows    : ", fv1.shape[0])
print("Total Number of Columns : ", fv1.shape[1])
print("\n")

print("2017 \n")
print("Total Number of Rows    : ", fv2.shape[0])
print("Total Number of Columns : ", fv2.shape[1])
print("\n")

print("2018 \n")
print("Total Number of Rows    : ", fv3.shape[0])
print("Total Number of Columns : ", fv3.shape[1])
print("\n")

print("2019 \n")
print("Total Number of Rows    : ", fv4.shape[0])
print("Total Number of Columns : ", fv4.shape[1])

2016

Total Number of Rows    :  372
Total Number of Columns :  5


2017

Total Number of Rows    :  372
Total Number of Columns :  5


2018

Total Number of Rows    :  372
Total Number of Columns :  5


2019

Total Number of Rows    :  396
Total Number of Columns :  5

In [47]:
# Printing the Null Values of All Dataset

print("2016 \n", fv1.isnull().sum() , "\n")

print("2017 \n", fv2.isnull().sum() , "\n")

print("2018 \n", fv3.isnull().sum() , "\n")

print("2019 \n", fv4.isnull().sum())

2016
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

2017
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

2018
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

2019
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [48]:
# Printing the Duplicates Values

print("2016 \n", fv1.duplicated().sum())
print("2017 \n", fv2.duplicated().sum())
print("2018 \n", fv3.duplicated().sum())
print("2019 \n", fv4.duplicated().sum())

2016
 0
2017
 0
2018
 0
2019
 0

In [49]:
# Removing the White Space

fv1.visitors = fv1.visitors.str.replace(' ','')
fv2.visitors = fv2.visitors.str.replace(' ','')
fv3.visitors = fv3.visitors.str.replace(' ','')
fv4.visitors = fv4.visitors.str.replace(' ','')

In [50]:
# Converting the dtypes of columns

fv1['date'] = pd.to_datetime(fv1['date'])
fv2['date'] = pd.to_datetime(fv2['date'])
fv3['date'] = pd.to_datetime(fv3['date'])
fv4['date'] = pd.to_datetime(fv4['date'])


fv1['year'] = fv1['year'].astype('int32')
fv2['year'] = fv2['year'].astype('int32')
fv3['year'] = fv3['year'].astype('int32')
fv4['year'] = fv4['year'].astype('int32') 

fv1['visitors'] = pd.to_numeric(fv1['visitors'], errors='coerce')
fv2['visitors'] = pd.to_numeric(fv2['visitors'], errors='coerce')
fv3['visitors'] = pd.to_numeric(fv3['visitors'], errors='coerce')
fv4['visitors'] = pd.to_numeric(fv4['visitors'], errors='coerce')

In [51]:
# replace NaN and inf values with zero

fv1['visitors'] = fv1['visitors'].replace([np.nan, np.inf], 0)
fv2['visitors'] = fv2['visitors'].replace([np.nan, np.inf], 0)
fv3['visitors'] = fv3['visitors'].replace([np.nan, np.inf], 0)
fv4['visitors'] = fv4['visitors'].replace([np.nan, np.inf], 0)

In [52]:
# cast the column to int32

fv1['visitors'] = fv1['visitors'].astype('int32')
fv2['visitors'] = fv2['visitors'].astype('int32')
fv3['visitors'] = fv3['visitors'].astype('int32')
fv4['visitors'] = fv4['visitors'].astype('int32')

In [53]:
# Merging all Dataset into one Dataset named Domestic_Visitors

foreign_visitors = pd.concat([fv1, fv2, fv3, fv4], axis=0)

# Printing the Top 5 Rows of Dataset

foreign_visitors.head()

   district       date     month  year  visitors
0  Adilabad 2016-01-01   January  2016         2
1  Adilabad 2016-01-02  February  2016         0
2  Adilabad 2016-01-03     March  2016         2
3  Adilabad 2016-01-04     April  2016         0
4  Adilabad 2016-01-05       May  2016         0

In [54]:
foreign_visitors.tail()

            district       date      month  year  visitors
391  Yadadri Bhongir 2019-01-08     August  2019         0
392  Yadadri Bhongir 2019-01-09  September  2019         0
393  Yadadri Bhongir 2019-01-10    October  2019         0
394  Yadadri Bhongir 2019-01-11   November  2019         0
395  Yadadri Bhongir 2019-01-12   December  2019         0

In [55]:
# Saving the fomestic_Visitors.csv file

foreign_visitors.to_csv("foreign_visitors.csv",index=False)

### Merging domestic and foreign visitors datasets :

In [58]:
domestic = pd.read_csv("E://challenge_5//C5 Input for participants//domestic_visitors.csv")
foreign = pd.read_csv("E://challenge_5//C5 Input for participants//foreign_visitors.csv")

In [59]:
print("Domestic Dataset Total Number of Rows and Columns : ", domestic.shape )
print("Foreign Dataset Total Number of Rows and Columns : ", foreign.shape )

Domestic Dataset Total Number of Rows and Columns :  (1512, 5)
Foreign Dataset Total Number of Rows and Columns :  (1512, 5)

In [60]:
# rename the visitors columns in both datasets..

foreign.rename(columns={"visitors" : "foreign_visitors"}, inplace=True)
domestic.rename(columns={'visitors' : "domestic_visitors"}, inplace=True)

In [61]:
# merging two datasets...

total_visitors = pd.concat([domestic, foreign['foreign_visitors']], axis=1)

In [63]:
total_visitors.shape

(1512, 6)

In [64]:
total_visitors.isnull().sum()

district             0
date                 0
month                0
year                 0
domestic_visitors    0
foreign_visitors     0
dtype: int64

In [67]:
total_visitors.domestic_visitors = total_visitors.domestic_visitors.astype(int)
total_visitors.foreign_visitors = total_visitors.foreign_visitors.astype(int)
total_visitors.year = total_visitors.year.astype(int)
total_visitors['total_visitors'] = total_visitors['domestic_visitors'] + total_visitors['foreign_visitors']

In [68]:
total_visitors.head()

,district,date,month,year,domestic_visitors,foreign_visitors,total_visitors
0,Adilabad,2016-01-01,January,2016,792136,2,792138
1,Adilabad,2016-01-02,February,2016,937820,0,937820
2,Adilabad,2016-01-03,March,2016,582946,2,582948
3,Adilabad,2016-01-04,April,2016,341948,0,341948
4,Adilabad,2016-01-05,May,2016,252887,0,252887

In [69]:
total_visitors.tail()

,district,date,month,year,domestic_visitors,foreign_visitors,total_visitors
1507,Yadadri Bhongir,2019-01-08,August,2019,389010,0,389010
1508,Yadadri Bhongir,2019-01-09,September,2019,366862,0,366862
1509,Yadadri Bhongir,2019-01-10,October,2019,381860,0,381860
1510,Yadadri Bhongir,2019-01-11,November,2019,365990,0,365990
1511,Yadadri Bhongir,2019-01-12,December,2019,477635,0,477635

In [70]:
# saving the total_visitors file into csv form...

total_visitors.to_csv("total_visitors.csv", index=False)

In [71]:
total_visitors.head()

,district,date,month,year,domestic_visitors,foreign_visitors,total_visitors
0,Adilabad,2016-01-01,January,2016,792136,2,792138
1,Adilabad,2016-01-02,February,2016,937820,0,937820
2,Adilabad,2016-01-03,March,2016,582946,2,582948
3,Adilabad,2016-01-04,April,2016,341948,0,341948
4,Adilabad,2016-01-05,May,2016,252887,0,252887